InformationRegisters/РеквизитыДляКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыДляКонтроля</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уникален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыРеквизитовДляКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РеквизитыДляКонтроля/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Объект) ИЛИ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтоКонтактнаяИнформация = Ложь;
	УсловиеЗаполнятьОбязательно = Ложь;
	ТипРеквизитаБулево = Ложь;

	Если Запись.Объект = Справочники.НаборыРеквизитовДляКонтроля.Справочник_Номенклатура
		ИЛИ Запись.Объект.Родитель = Справочники.НаборыРеквизитовДляКонтроля.Справочник_Номенклатура Тогда
		Если Запись.ИмяРеквизита = "Родитель" Тогда
			Реквизит = Метаданные.Справочники.Номенклатура.СтандартныеРеквизиты[Запись.ИмяРеквизита];
		Иначе	
			Реквизит = Метаданные.Справочники.Номенклатура.Реквизиты[Запись.ИмяРеквизита];
		КонецЕсли;
		
	ИначеЕсли Запись.Объект = Справочники.НаборыРеквизитовДляКонтроля.Справочник_Контрагенты
		ИЛИ Запись.Объект.Родитель = Справочники.НаборыРеквизитовДляКонтроля.Справочник_Контрагенты Тогда
		Если Запись.ИмяРеквизита = "Родитель" Тогда
			Реквизит = Метаданные.Справочники.Контрагенты.СтандартныеРеквизиты[Запись.ИмяРеквизита];
		ИначеЕсли Запись.ИмяРеквизита = "Контактная информация.Телефон" ИЛИ Запись.ИмяРеквизита = "Контактная информация.Email" Тогда
		    ЭтоКонтактнаяИНформация = Истина;
		Иначе	
			Реквизит = Метаданные.Справочники.Контрагенты.Реквизиты[Запись.ИмяРеквизита];
		КонецЕсли;		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоКонтактнаяИнформация Тогда
		ТипРеквизитаБулево = (Реквизит.Тип = Новый ОписаниеТипов("Булево"));
		УсловиеЗаполнятьОбязательно = (Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку);
	КонецЕсли;
	
	Элементы.ЗаполнятьОбязательно.Доступность = НЕ ТипРеквизитаБулево И НЕ УсловиеЗаполнятьОбязательно;
	Элементы.ДекорацияЗаполнятьОбязательно.Видимость = УсловиеЗаполнятьОбязательно;
		
	Элементы.Уникален.Доступность = НЕ ТипРеквизитаБулево;
	
КонецПроцедуры
